[
  {
    "id": "paypal",
    "title": "PayPal",
    "backgroundColor": "#03a9f4",
    "heroImage": "./images/portfolio/paypal_contacts.png",
    "icon": "./images/icons/paypal.png",
    "link": "https://www.paypal.com/myaccount/transfer",
    "description": "I served as a tech lead for consumer send-money web team. My main responsibility at PayPal was to add new features and maintain the send money web experience. I created the architecture for integrating the send money web experience into internal and external partnerships such as PayPal.me and Outlook.com",
    "timeline": "2013-2016"
  },
  {
    "id": "homeaway",
    "title": "HomeAway",
    "backgroundColor": "#009688",
    "heroImage": "./images/portfolio/homeaway_luxury.jpg",
    "icon": "./images/icons/homeaway.png",
    "link": "https://www.homeaway.com/",
    "description": "I was one of the front end engineers for the global traveler team at HomeAway. During my time there, I added the ability to 'Favorites' properties, built a kanban management tool named 'Dillernator', built out the luxury version of Homeaway (luxury.homeaway.com), and migrated a vanillajs codebase to Backbone. Every two weeks I would make presentations to my team on new technologies, as well as opening discussion on ways we can improve our code base. Outside of my team work, I hosted company-wide hackathons.",
    "timeline": "2011-2013"
  },
  {
    "id": "razorfish",
    "title": "Razorfish",
    "backgroundColor": "#000",
    "heroImage": "",
    "icon": "./images/icons/razorfish.jpg",
    "link": "",
    "description": "I started my career working on front-end experiences at Razorfish. My work ranged from building websites in flash, asp.net, jQuery, mobile-web, to building advertisements on the back of the chairs on air planes.",
    "timeline": "2008-2010"
  },
  {
    "id": "personal",
    "title": "Personal",
    "backgroundColor": "#3f516f",
    "heroImage": "./images/portfolio/websockets_life.png",
    "icon": "./images/icons/personal.png",
    "link": "https://github.com/TheIronDeveloper?tab=repositories",
    "description": "I've worked on a variety of personal projects. Most of my projects are built with a side-intention of exploring new technologies. Some of my projects include: Websockets of life, a websocket implementation of Conway's Game of Life, Dom-to-canvas, a vanillajs dom-tree render, and WonderTradeAnalytics.com, an express webapp that displays graphs based on user submitted wonder trade data.",
    "timeline": "2012-Present"
  }
]